nxp-mcuxpresso/mcux-soc-svd/MCXA176/MCXA176.xml
        <register>
          <name>SSTATUS</name>
          <description>Target Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STNOTSTOP</name>
              <description>Status not Stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPPED</name>
                  <description>In STOP condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STMSG</name>
              <description>Status Message</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCCCH</name>
              <description>Status Common Command Code Handler</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>No CCC message handled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Handled automatically</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STREQRD</name>
              <description>Status Request Read</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Not an SDR read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>SDR read from this target or an IBI is being pushed out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STREQWR</name>
              <description>Status Request Write</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Not an SDR write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>SDR write data from the controller, but not in ENTDAA mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STDAA</name>
              <description>Status Dynamic Address Assignment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_IN_ENTDAA</name>
                  <description>Not in ENTDAA mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_ENTDAA</name>
                  <description>In ENTDAA mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STHDR</name>
              <description>Status High Data Rate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_IN_HDR_DDR</name>
                  <description>I3C bus not in HDR-DDR mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_HDR_DDR</name>
                  <description>I3C bus in HDR-DDR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>START_NOT_DETECTED</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_DETECTED</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MATCHED</name>
              <description>Matched Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NOT_MATCHED</name>
                  <description>Header not matched</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCHED</name>
                  <description>Header matched</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_STOP_DETECTED</name>
                  <description>No Stopped state detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_DETECTED</name>
                  <description>Stopped state detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PEND</name>
              <description>Received Message Pending</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MSG_PENDING</name>
                  <description>No received message pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_PENDING</name>
                  <description>Received message pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXNOTFULL</name>
              <description>Transmit Buffer Not Full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Transmit buffer full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <description>Transmit buffer not full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACHG</name>
              <description>Dynamic Address Change Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_CHANGE_DETECTED</name>
                  <description>No DA change detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANGE_DETECTED</name>
                  <description>DA change detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCC</name>
              <description>Common Command Code Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_CCC_RECEIVED</name>
                  <description>CCC not received</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCC_RECEIVED</name>
                  <description>CCC received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRWARN</name>
              <description>Error Warning</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDRMATCH</name>
              <description>High Data Rate Command Match Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_MATCH</name>
                  <description>Did not match</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCH</name>
                  <description>Matched the I3C dynamic address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHANDLED</name>
              <description>Common Command Code Handled Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NOT_HANDLED</name>
                  <description>CCC handling not in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HANDLED</name>
                  <description>CCC handling in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENT</name>
              <description>Event Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_EVENT</name>
                  <description>No event occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>IBI, CR, or HJ occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVDET</name>
              <description>Event Details</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>NONE (no event or no pending event)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>NO_REQUEST (request is not sent yet; either there is no START condition yet, or is waiting for Bus-Available or Bus-Idle (HJ))</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACKED</name>
                  <description>NACKed (not acknowledged, request sent and rejected); I3C tries again</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKED</name>
                  <description>ACKed (acknowledged; request sent and accepted), so done (unless the time control data is still being sent)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBIDIS</name>
              <description>In-Band Interrupts Disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPTS_ENABLED</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPTS_DISABLED</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRDIS</name>
              <description>Controller Requests Disable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MR_ENABLED</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_DISABLED</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HJDIS</name>
              <description>Hot-Join Disabled</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MR_ENABLED</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_DISABLED</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTSTATE</name>
              <description>Activity State from Common Command Codes (CCC)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LATENCY</name>
                  <description>NO_LATENCY (normal bus operations)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY_1MS</name>
                  <description>LATENCY_1MS (1 ms of latency)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY_100MS</name>
                  <description>LATENCY_100MS (100 ms of latency)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY_10S</name>
                  <description>LATENCY_10S (10 seconds of latency)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMECTRL</name>
              <description>Time Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIME_CONTROL</name>
                  <description>NO_TIME_CONTROL (no time control is enabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>SYNC_MODE (Synchronous mode is enabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNC_MODE</name>
                  <description>ASYNC_MODE (Asynchronous standard mode (0 or 1) is enabled)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHSYNCASYNC</name>
                  <description>BOTHSYNCASYNC (both Synchronous and Asynchronous modes are enabled)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRL</name>
          <description>Target Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT</name>
              <description>Event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <description>NORMAL_MODE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBI</name>
                  <description>IBI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_REQUEST</name>
                  <description>CONTROLLER_REQUEST</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOT_JOIN_REQUEST</name>
                  <description>HOT_JOIN_REQUEST</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTDATA</name>
              <description>Extended Data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBIDATA</name>
              <description>In-Band Interrupt Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDINT</name>
              <description>Pending Interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTSTATE</name>
              <description>Activity State of Target</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VENDINFO</name>
              <description>Vendor Information</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
